[refactor] : tweeny Demo
